/* Double tap to toggle controls */
"bcovbasicplaybackcontroller_001" = "انقر مرتين للتبديل بين عناصر التحكم";

/* Video */
"bcovbasicplaybackcontroller_002" = "مقطع فيديو";

/* AVPlayer.currentItem.status == AVPlayerItemStatusFailed, meaning video '%@' could not be loaded OR... */
"bcovbasicplaybacksession_001" = "AVPlayer.currentItem.status == AVPlayerItemStatusFailed, meaning video '%@' could not be loaded OR the AVFoundation media services have crashed. The latter can occur when an AVPlayer attempts a synchronous operation that exceeds the built-in iOS timeout. Because the AVFoundation media services are a device-global resource, this can occur as a side effect due to misbehavior in another app running on the device.";

/* There is no recovery from this error; you should abort playback and/or advance to the next video. */
"bcovbasicplaybacksession_002" = "There is no recovery from this error; you should abort playback and/or advance to the next video.";

/* AVPlayerItemFailedToPlayToEndTimeNotification was fired for the current item. This likely means... */
"bcovbasicplaybacksession_003" = "AVPlayerItemFailedToPlayToEndTimeNotification was fired for the current item. This likely means that there was a network error or a problem with the media.";

/* If the error was caused by a network interruption, you should test for network continuity. If the network returns... */
"bcovbasicplaybacksession_004" = "If the error was caused by a network interruption, you should test for network continuity. If the network returns, use `- [BCOVPlaybackController - (void)resumeVideoAtTime:withAutoPlay:]` to resume the video.";

/* Offline video playback error. */
"bcovbasicsessionprovider_001" = "خطأ في تشغيل مقطع الفيديو دون اتصال";

/* There is no recovery from this error; you should abort playback and/or advance to the next video. */
"bcovbasicsessionprovider_002" = "There is no recovery from this error; you should abort playback and/or advance to the next video.";

/* No playable source was found by the Source selection policy. If using the default source selection policy... */
"bcovbasicsessionprovider_003" = "No playable source was found by the Source selection policy. If using the default source selection policy, ensure your BCOVVideo has HLS sources. If implementing a custom source selection policy, ensure it is not returning nil.";

/* There is no recovery from this error; you should abort playback and/or advance to the next video. */
"bcovbasicsessionprovider_004" = "There is no recovery from this error; you should abort playback and/or advance to the next video.";

/* No Wifi connection is available. */
"bcovbasicsessionprovider_005" = "No Wifi connection is available.";

/* Enable WiFi or enable the `allowsCellularPlayback` property on BCOVGlobalConfiguration.sharedConfig and load the video again. */
"bcovbasicsessionprovider_006" = "Enable WiFi or enable the `allowsCellularPlayback` property on BCOVGlobalConfiguration.sharedConfig and load the video again.";

/* FairPlay license preloading is only supported for videos using FairPlay. */
"bcovofflinevideomanager_001" = "FairPlay license preloading is only supported for videos using FairPlay.";

/* This video has already been downloaded. */
"bcovofflinevideomanager_002" = "تم تنزيل مقطع الفيديو هذا بالفعل";

/* No valid download source was found. */
"bcovofflinevideomanager_003" = "No valid download source was found.";

/* Failed to find a variant URL while preloading the FairPlay video. */
"bcovofflinevideomanager_004" = "Failed to find a variant URL while preloading the FairPlay video.";

/* Could not preload a FairPlay video license. */
"bcovofflinevideomanager_005" = "Could not preload a FairPlay video license.";

/* Could not retrieve content key while preloading a FairPlay video (HTTP error: %ld). */
"bcovofflinevideomanager_006" = "Could not retrieve content key while preloading a FairPlay video (HTTP error: %ld).";

/* Could not preload a FairPlay video license due to a network error. */
"bcovofflinevideomanager_007" = "Could not preload a FairPlay video license due to a network error.";

/* FairPlay license preloading is only supported on iOS 10.3 and later. */
"bcovofflinevideomanager_008" = "FairPlay license preloading is only supported on iOS 10.3 and later.";

/* Video requested for download was nil. */
"bcovofflinevideomanager_010" = "قيمة مقطع الفيديو المطلوب للتنزيل كانت صفرًا";

/* This video is not eligible for offline playback. */
"bcovofflinevideomanager_011" = "مقطع الفيديو هذا غير مؤهل للتشغيل دون اتصال";

/* Invalid (non-JSON) video.properties passed to preload/download method. */
"bcovofflinevideomanager_012" = "Invalid (non-JSON) video.properties passed to preload/download method.";

/* Invalid (non-JSON) parameters passed to preload/download method. */
"bcovofflinevideomanager_013" = "Invalid (non-JSON) parameters passed to preload/download method.";

/* Invalid rental duration specified for FairPlay license: %f seconds. */
"bcovofflinevideomanager_014" = "Invalid rental duration specified for FairPlay license: %f seconds.";

/* This video has already been downloaded. */
"bcovofflinevideomanager_015" = "This video has already been downloaded.";

/* Invalid parameters were specified for the license request. */
"bcovofflinevideomanager_016" = "Invalid parameters were specified for the license request.";

/* rentalDurationValue == nil && purchaseValue == nil */
"bcovofflinevideomanager_017" = "(no purchase, no rental duration)";

/* purchaseLicense && (rentalDurationValue != nil) */
"bcovofflinevideomanager_018" = "(purchase == YES, rental duration)";

/* !purchaseLicense && (rentalDurationValue == nil) */
"bcovofflinevideomanager_019" = "(purchase == NO, no rental duration)";

/* A problem occurred while downloading the video. */
"bcovofflinevideomanager_020" = "حدثت مشكلة أثناء تنزيل مقطع الفيديو";

/* Check your internet connection. */
"bcovofflinevideomanager_021" = "تحقق من اتصالك بشبكة الإنترنت";

/* No valid download source was found. */
"bcovofflinevideomanager_022" = "No valid download source was found.";

/* The download task could not be created. */
"bcovofflinevideomanager_023" = "The download task could not be created.";

/* The network may be down, or the video source invalid. */
"bcovofflinevideomanager_024" = "قد تكون الشبكة معطلة أو مصدر مقطع الفيديو غير صالح";

/* The offline video token used for FairPlay license renewal was invalid. */
"bcovofflinevideomanager_025" = "The offline video token used for FairPlay license renewal was invalid.";

/* Invalid (non-JSON) parameters passed to license renew method. */
"bcovofflinevideomanager_026" = "Invalid (non-JSON) parameters passed to license renew method.";

/* Invalid parameters were specified for license renewal. */
"bcovofflinevideomanager_027" = "Invalid parameters were specified for license renewal.";

/* rentalDurationValue == nil && purchaseValue == nil */
"bcovofflinevideomanager_028" = "(no purchase, no rental duration)";

/* purchaseLicense && (rentalDurationValue != nil) */
"bcovofflinevideomanager_029" = "(purchase == YES, rental duration)";

/* !purchaseLicense && (rentalDurationValue == nil) */
"bcovofflinevideomanager_030" = "(purchase == NO, no rental duration)";

/* Invalid rental duration specified for FairPlay license: %f seconds. */
"bcovofflinevideomanager_031" = "Invalid rental duration specified for FairPlay license: %f seconds.";

/* The bitrate cannot be changed when renewing an offline FairPlay license. */
"bcovofflinevideomanager_032" = "The bitrate cannot be changed when renewing an offline FairPlay license.";

/* The video parameter does not match the offline video while renewing an offline FairPlay license. */
"bcovofflinevideomanager_034" = "The video parameter does not match the offline video while renewing an offline FairPlay license.";

/* No FairPlay source was found while renewing an offline FairPlay license. */
"bcovofflinevideomanager_035" = "No FairPlay source was found while renewing an offline FairPlay license.";

/* Content identifier URI was invalid while renewing FairPlay license. */
"bcovofflinevideomanager_036" = "Content identifier URI was invalid while renewing FairPlay license.";

/* FairPlay license renewal is only supported on iOS 10.3 and later. */
"bcovofflinevideomanager_037" = "FairPlay license renewal is only supported on iOS 10.3 and later.";

/* No video file path found for offline video token %@. */
"bcovofflinevideomanager_038" = "No video file path found for offline video token %@.";

/* Could not retrieve WebVTT file at URL: %@; HTTP status code %@. */
"bcovofflinevideomanager_039" = "Could not retrieve WebVTT file at URL: %@; HTTP status code %@.";

/* An error occurred while downloading a video. */
"bcovofflinevideomanager_040" = "An error occurred while downloading a video.";

/* BCOVVideo is nil in retrieveHLSManifest. */
"bcovofflinevideomanager_041" = "BCOVVideo is nil in retrieveHLSManifest.";

/* No valid HLS source for video in retrieveHLSManifest. */
"bcovofflinevideomanager_042" = "No valid HLS source for video in retrieveHLSManifest.";

/* Could not retrieve manifest at URL: %@. */
"bcovofflinevideomanager_043" = "Could not retrieve manifest at URL: %@.";

/* Could not retrieve manifest at URL: %@; HTTP status code %@. */
"bcovofflinevideomanager_044" = "Could not retrieve manifest at URL: %@; HTTP status code %@.";

/* The video's secondary tracks could not be downloaded. */
"bcovofflinevideomanager_045" = "تعذر تنزيل المسارات الثانوية لمقطع الفيديو";

/* Content key exchange error.\n\tContent key: %@\nOffline Video Token: %@. */
"bcovofflinevideomanager_046" = "Content key exchange error.\n\tContent key: %@\nOffline Video Token: %@.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_047" = "There is no recovery from this error.";

/* Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed while requesting application certificate. */
"bcovofflinevideomanager_048" = "Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed while requesting application certificate.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_049" = "There is no recovery from this error.";

/* Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed because a default application certificate could not be found. */
"bcovofflinevideomanager_050" = "Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed because a default application certificate could not be found.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_051" = "There is no recovery from this error.";

/* Call to -[AVContentKeyRequest makeStreamingContentKeyRequestDataForApp:contentIdentifier:options:completionHandler:] failed with error. */
"bcovofflinevideomanager_052" = "Call to -[AVContentKeyRequest makeStreamingContentKeyRequestDataForApp:contentIdentifier:options:completionHandler:] failed with error.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_053" = "There is no recovery from this error.";

/* persistentContentKeyFromKeyVendorResponse failure */
"bcovofflinevideomanager_054" = "persistentContentKeyFromKeyVendorResponse failure";

/* There is no recovery from this error. */
"bcovofflinevideomanager_055" = "There is no recovery from this error.";

/* Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForContentKeyIdentifier:contentKeyRequest:completionHandler:] failed. */
"bcovofflinevideomanager_056" = "Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForContentKeyIdentifier:contentKeyRequest:completionHandler:] failed.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_057" = "There is no recovery from this error.";

/* Could not retrieve application certificate. NSURLSessionDataTask failed. */
"bcovofflinevideomanager_058" = "Could not retrieve application certificate. NSURLSessionDataTask failed.";

/* There is no recovery from this error. Internet may be down. */
"bcovofflinevideomanager_059" = "There is no recovery from this error. Internet may be down.";

/* Could not retrieve application certificate. Invalid HTTP status code `%@` returned. */
"bcovofflinevideomanager_060" = "Could not retrieve application certificate. Invalid HTTP status code `%@` returned.";

/* There is no recovery from this error. Check validity of certificate_url. */
"bcovofflinevideomanager_061" = "There is no recovery from this error. Check validity of certificate_url.";

/* Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed while requesting application certificate. */
"bcovofflinevideomanager_062" = "Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed while requesting application certificate.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_063" = "There is no recovery from this error.";

/* Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed because a default application certificate could not be found. */
"bcovofflinevideomanager_064" = "Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed because a default application certificate could not be found.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_065" = "There is no recovery from this error.";

/* Call to -[AVAssetResourceLoadingRequest streamingContentKeyRequestDataForApp:contentIdentifier:options:error:] failed. */
"bcovofflinevideomanager_066" = "Call to -[AVAssetResourceLoadingRequest streamingContentKeyRequestDataForApp:contentIdentifier:options:error:] failed.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_067" = "There is no recovery from this error.";

/* persistentContentKeyFromKeyVendorResponse failure. */
"bcovofflinevideomanager_068" = "persistentContentKeyFromKeyVendorResponse failure.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_069" = "There is no recovery from this error.";

/* Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed. */
"bcovofflinevideomanager_070" = "Call to -[BCOVFPSAuthorizationProxy encryptedContentKeyForLoadingRequest:contentKeyRequest:completionHandler:] failed.";

/* There is no recovery from this error. */
"bcovofflinevideomanager_071" = "There is no recovery from this error.";

/* Ad (%@ of %@) */
"bcovpuiadcontrolview_001" = "إعلان %@ من %@";

/* Your video will resume in %@ seconds (plural) */
"bcovpuiadcontrolview_002" = "سيتم استئناف مقطع الفيديو الخاص بك خلال %@ ثوان";

/* Your video will resume in %@ second (singular) */
"bcovpuiadcontrolview_003" = "سيتم استئناف مقطع الفيديو الخاص بك خلال %@ ثوان";

/* Learn More */
"bcovpuiadcontrolview_004" = "معرفة المزيد";

/* You can skip this ad in %@ seconds (plural) */
"bcovpuiadcontrolview_005" = "يمكنك تخطي هذا الإعلان\nخلال %@ ثوان";

/* You can skip this ad in %@ second (singular) */
"bcovpuiadcontrolview_006" = "يمكنك تخطي هذا الإعلان\nخلال %@ ثوان";

/* Skip Ad ⇥ */
"bcovpuiadcontrolview_007" = "تخطي الإعلان";

/* Ad: Press play to resume video */
"bcovpuiadcontrolview_008" = "إعلان: اضغط على تشغيل لاستئناف تشغيل مقطع الفيديو";

/* %@s */
"bcovpuiadcontrolview_009" = "%@s";

/* video playback is Live */
"bcovpuibasiccontrolview_001" = "مباشر";

/* Current Time */
"bcovpuibasiccontrolview_002" = "الوقت الحالي";

/* Duration */
"bcovpuibasiccontrolview_003" = "المدة";

/* Current playhead position */
"bcovpuibasiccontrolview_004" = "الموضع الحالي";

/* video playback is Live */
"bcovpuibutton_001" = "مباشر";

/* Play */
"bcovpuibutton_002" = "تشغيل";

/* Pause */
"bcovpuibutton_003" = "إيقاف مؤقت";

/* Enter Fullscreen */
"bcovpuibutton_004" = "الدخول إلى وضع ملء الشاشة";

/* Exit Fullscreen */
"bcovpuibutton_005" = "الخروج من وضع ملء الشاشة";

/* Jump Back (short-duration rewind) */
"bcovpuibutton_006" = "الانتقال بسرعة إلى الخلف";

/* Audio & Subtitles */
"bcovpuibutton_007" = "المقطع الصوتي والترجمات";

/* 360 Video */
"bcovpuibutton_008" = "مقطع فيديو بتقنية 360 درجة";

/* Preferred Bitrate */
"bcovpuibutton_009" = "معدل البت المفضل";

/* Picture in Picture */
"bcovpuibutton_010" = "صورة داخل صورة";

/* AirPlay */
"bcovpuibutton_011" = "AirPlay";

/* Audio & Subtitles menu title */
"bcovpuiclosedcaptionhandler_001" = "المقطع الصوتي والترجمات";

/* Legible options menu heading */
"bcovpuiclosedcaptionhandler_002" = "الترجمات";

/* Audible media options menu heading */
"bcovpuiclosedcaptionhandler_003" = "مقطع صوتي";

/* Legible media options menu heading */
"bcovpuiclosedcaptionhandler_004" = "الترجمات والتعليقات التوضيحية المغلقة";

/* Off */
"bcovpuiclosedcaptionhandler_005" = "إيقاف التشغيل";

/* Automatic selection (a menu item) */
"bcovpuiclosedcaptionhandler_006" = "تلقائي (مستحسن)";

/* Automatic */
"bcovpuipreferredbitratehandler_001" = "تلقائي";

/* Live */
"bcovtvcontroller_001" = "مباشر";

/*  Live Stream Paused */
"bcovtvcontroller_002" = " تم إيقاف البث المباشر مؤقتًا";

/* Media Controls, %@ elapsed, %@ remaining */
"bcovtvcontroller_003" = "عناصر التحكم في الوسائط، انقضى %@، يتبقى %@";

/* Advertisement (%@ of %@) */
"bcovtvcontroller_004" = "الإعلان (%@ من %@)";

/* Show Tab Bar */
"bcovtvsettingsview_001" = "إظهار شريط علامات التبويب";

/* Unknown */
"bcovtvsettingsview_002" = "غير معروف";

/* Unknown */
"bcovtvtabbaritemview_001" = "غير معروف";

/* Info */
"bcovtvtabbaritemview_002" = "معلومات";

/* More (show more information; button title) */
"bcovtvtabbaritemview_003" = "المزيد";

/* Unknown */
"bcovtvtabbaritemview_004" = "غير معروف";

/* %@ minutes */
"bcovtvtabbaritemview_005" = "%@ دقائق";

/* Subtitles */
"bcovtvtabbaritemview_006" = "الترجمات";

/* Off (menu item title) */
"bcovtvtabbaritemview_007" = "إيقاف التشغيل";

/* Auto (menu item title) */
"bcovtvtabbaritemview_008" = "تلقائي";

/* Audio (window title) */
"bcovtvtabbaritemview_009" = "مقطع صوتي";

